Catalogs/стомОбластиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомОбластиСегментов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Декоративная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбласти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыОбластей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерединаКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомОбластиСегментов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если ЭтоНовый Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидОбласти) Тогда
			Объект.ВидОбласти = Перечисления.стомВидыОбластей.ОбластьЗуба;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбластиПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	ЭтоЭлементКонструкции = 
		(Объект.ВидОбласти = ПредопределенноеЗначение("Перечисление.стомВидыОбластей.ЭлементКонструкции"));
	ЭтоКонструкция = 
		(Объект.ВидОбласти = ПредопределенноеЗначение("Перечисление.стомВидыОбластей.Конструкция"));
			
	Элементы.Декоративная.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.Обозначение.Видимость = ЭтоКонструкция;
	Элементы.ГруппаКонструкции.Видимость = ЭтоКонструкция;
	Элементы.ГруппаСостояния.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.ГруппаПараметры.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.КонструкцияРодитель.Видимость = ЭтоЭлементКонструкции;
	Элементы.ВидОбласти.ТолькоПросмотр = ЭтоЭлементКонструкции;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда 
		Возврат;
	КонецЕсли;
	
	ОтборФормы = Новый Структура;
	ОтборФормы.Вставить("ВидОбласти", ПредопределенноеЗначение("Перечисление.стомВидыОбластей.ЭлементКонструкции"));
	ОтборФормы.Вставить("КонструкцияРодитель", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ОтборФормы);
	
	ОткрытьФорму("Справочник.стомОбластиСегментов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры
